###################################################################

# Created by write_sdc on Sun Jan  1 14:59:42 2017

###################################################################
set cycle 20
set t_in [expr $cycle/2]
set t_out 0.5
create_clock -name clk -period $cycle [get_ports clk]
set_clock_uncertainty    0.1 [get_clocks]
set_clock_latency        0.5 [get_clocks]
set_max_fanout     6 [all_inputs]

set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports done]
set_load -pin_load 1 [get_ports {freq[3]}]
set_load -pin_load 1 [get_ports {freq[2]}]
set_load -pin_load 1 [get_ports {freq[1]}]
set_load -pin_load 1 [get_ports {freq[0]}]
set_max_fanout 6 [get_ports data_valid]
set_max_fanout 6 [get_ports {data[15]}]
set_max_fanout 6 [get_ports {data[14]}]
set_max_fanout 6 [get_ports {data[13]}]
set_max_fanout 6 [get_ports {data[12]}]
set_max_fanout 6 [get_ports {data[11]}]
set_max_fanout 6 [get_ports {data[10]}]
set_max_fanout 6 [get_ports {data[9]}]
set_max_fanout 6 [get_ports {data[8]}]
set_max_fanout 6 [get_ports {data[7]}]
set_max_fanout 6 [get_ports {data[6]}]
set_max_fanout 6 [get_ports {data[5]}]
set_max_fanout 6 [get_ports {data[4]}]
set_max_fanout 6 [get_ports {data[3]}]
set_max_fanout 6 [get_ports {data[2]}]
set_max_fanout 6 [get_ports {data[1]}]
set_max_fanout 6 [get_ports {data[0]}]
set_max_fanout 6 [get_ports clk]
set_max_fanout 6 [get_ports rst]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  10  [get_ports data_valid]
set_input_delay -clock clk  10  [get_ports {data[15]}]
set_input_delay -clock clk  10  [get_ports {data[14]}]
set_input_delay -clock clk  10  [get_ports {data[13]}]
set_input_delay -clock clk  10  [get_ports {data[12]}]
set_input_delay -clock clk  10  [get_ports {data[11]}]
set_input_delay -clock clk  10  [get_ports {data[10]}]
set_input_delay -clock clk  10  [get_ports {data[9]}]
set_input_delay -clock clk  10  [get_ports {data[8]}]
set_input_delay -clock clk  10  [get_ports {data[7]}]
set_input_delay -clock clk  10  [get_ports {data[6]}]
set_input_delay -clock clk  10  [get_ports {data[5]}]
set_input_delay -clock clk  10  [get_ports {data[4]}]
set_input_delay -clock clk  10  [get_ports {data[3]}]
set_input_delay -clock clk  10  [get_ports {data[2]}]
set_input_delay -clock clk  10  [get_ports {data[1]}]
set_input_delay -clock clk  10  [get_ports {data[0]}]
set_input_delay -clock clk  10  [get_ports rst]
set_output_delay -clock clk  0.5  [get_ports done]
set_output_delay -clock clk  0.5  [get_ports {freq[3]}]
set_output_delay -clock clk  0.5  [get_ports {freq[2]}]
set_output_delay -clock clk  0.5  [get_ports {freq[1]}]
set_output_delay -clock clk  0.5  [get_ports {freq[0]}]
set_drive 1  [get_ports data_valid]
set_drive 1  [get_ports {data[15]}]
set_drive 1  [get_ports {data[14]}]
set_drive 1  [get_ports {data[13]}]
set_drive 1  [get_ports {data[12]}]
set_drive 1  [get_ports {data[11]}]
set_drive 1  [get_ports {data[10]}]
set_drive 1  [get_ports {data[9]}]
set_drive 1  [get_ports {data[8]}]
set_drive 1  [get_ports {data[7]}]
set_drive 1  [get_ports {data[6]}]
set_drive 1  [get_ports {data[5]}]
set_drive 1  [get_ports {data[4]}]
set_drive 1  [get_ports {data[3]}]
set_drive 1  [get_ports {data[2]}]
set_drive 1  [get_ports {data[1]}]
set_drive 1  [get_ports {data[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst]
